aaron-bond.better-comments
alefragnani.project-manager
anthropic.claude-code
anysphere.remote-ssh
assisrmatheus.sidebar-markdown-notes
ayecue.tab-stack
daniel-duc.daniel-material-palenight-theme
dracula-theme.theme-dracula
eamodio.gitlens
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
fogio.jetbrains-color-theme
johnpapa.vscode-peacock
laurenttreguier.vscode-simple-icons
lyuwenhan.sidebar-notes
miguelsolorio.fluent-icons
monokai.theme-monokai-pro-vscode
ms-vscode.vscode-typescript-next
nur-srijan.markdown-rich-preview
pkief.material-icon-theme
rid9.datetime
ryuta46.multi-command
sdras.night-owl
sguerri.simple-hide-files
shalldie.background
steoates.autoimport
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vscodevim.vim
yoavbls.pretty-ts-errors
zaaack.markdown-editor
zhuangtongfa.material-theme
